mkaradeli/Metu-X-stm32/CM7/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

#include "stm32h7xx_nucleo.h"
#include <stdio.h>

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */
//#define HX711_DOUT_GPIO_Port GPIOG
//#define HX711_DOUT_Pin GPIO_PIN_9
//
//#define HX711_SCK_GPIO_Port GPIOG
//#define HX711_SCK_Pin GPIO_PIN_12
//
//#define LEFT_EN_1_GPIO_Port GPIOE
//#define LEFT_EN_1_Pin GPIO_PIN_10
//
//#define RIGHT_EN_1_GPIO_Port GPIOE
//#define RIGHT_EN_1_Pin GPIO_PIN_12



/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define RIGHT_EN_1_Pin GPIO_PIN_7
#define RIGHT_EN_1_GPIO_Port GPIOE
#define RIGHT_EN_30000_Pin GPIO_PIN_8
#define RIGHT_EN_30000_GPIO_Port GPIOE
#define LEFT_EN_1_Pin GPIO_PIN_10
#define LEFT_EN_1_GPIO_Port GPIOE
#define RIGHT_EN_1E12_Pin GPIO_PIN_12
#define RIGHT_EN_1E12_GPIO_Port GPIOE
#define LEFT_EN_2_Pin GPIO_PIN_15
#define LEFT_EN_2_GPIO_Port GPIOE
#define LEFT_EN_3_Pin GPIO_PIN_11
#define LEFT_EN_3_GPIO_Port GPIOB
#define RIGHT_EN_4_Pin GPIO_PIN_12
#define RIGHT_EN_4_GPIO_Port GPIOB
#define USB_OTG_FS_PWR_EN_Pin GPIO_PIN_10
#define USB_OTG_FS_PWR_EN_GPIO_Port GPIOD
#define RIGHT_EN_3_Pin GPIO_PIN_9
#define RIGHT_EN_3_GPIO_Port GPIOG
#define HX711_SCK_Pin GPIO_PIN_12
#define HX711_SCK_GPIO_Port GPIOG

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
